skillfair/app/controllers/products_controller.rb

  def destroy
    @product.destroy!
---
DELETE FROM "products" WHERE "products"."id" = 1

    def set_product
      @product = Product.find(params.expect(:id))
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1